adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x34</addressOffset>
              <cluster>
                <dim>3</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for RADIOCORE.MEMCONF.TRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>RADIO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_RADIOCORE_RADIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x40</addressOffset>
              <cluster>
                <name>SPHYNXANA</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_RADIO_SPHYNXANA</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>FSCTRL0</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL0</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FSCTRL1</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL1</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FSCTRL2</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.FSCTRL2</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RXCTRL</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.RXCTRL</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>OVRRXTRIMCODE</name>
                  <description>Trim value for RADIOCORE.RADIO.SPHYNXANA.OVRRXTRIMCODE</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>RXAGC</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_RADIOCORE_RADIO_RXAGC</headerStructName>
                <access>read-write</access>
                <addressOffset>0x14</addressOffset>
                <register>
                  <name>CALIBRATION</name>
                  <description>Trim value for RSSICAL and ED154CAL in RADIOCORE.RADIO.RXAGC.CALIBRATION</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>PVTTOT</name>
                <description>Trim value for RADIOCORE.RADIO.EXPECTEDPVTTOTRATIO</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>KDTC</name>
                <description>Trim value for RADIOCORE.RADIO.ESTKDTCVAL</description>
                <addressOffset>0x1C</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>TXHFGAIN</name>
                <description>Trim value for RADIOCORE.RADIO.TXINTERFACEHFGAIN</description>
                <addressOffset>0x20</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>PVTTOFIX</name>
                <description>Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND6</description>
                <addressOffset>0x24</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>LOOPGAIN</name>
                <description>Trim value for RADIOCORE.RADIO.ADPLLSTARTUPCOMMAND5</description>
                <addressOffset>0x28</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>BOOT</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_BOOT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3DC</addressOffset>
            <cluster>
              <name>VREG1V0</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_VREG1V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>VOUTHPNOMINAL</name>
                <description>Trim value for SYSCTRL.VREG1V0.VOUTHPNOMINAL</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>HSFLL120</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_HSFLL120</headerStructName>
              <access>read-write</access>
              <addressOffset>0x004</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for SYSCTRL.HSFLL120.VSUP</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>COARSE</name>
                <description>Trim value for SYSCTRL.HSFLL120.COARSE</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FINE</name>
                <description>Trim value for SYSCTRL.HSFLL120.FINE</description>
                <addressOffset>0x008</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>OTPC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_OTPC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x010</addressOffset>
              <register>
                <name>WAITSTATES</name>
                <description>OTPC waitstates trim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>WAITSTATES</name>
                    <description>Waitstates</description>
                    <lsb>0</lsb>
                    <msb>6</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FREQUENCY</name>
                <description>OTPC frequency tim when running with TRIM.BOOT.HSFLL120 trims</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>FREQUENCY</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>COMMON</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_COMMON</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3F4</addressOffset>
            <register>
              <name>FFFF</name>
              <description>Value to be written to multibit MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>FFFF</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ZERO</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=0)</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ZERO</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ONE</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>ONE</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECURE</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.FINE</description>
                  <addressOffset>0x01C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HSFLL200</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_HSFLL200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x034</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_HSFLL200_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL200.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.FINE</description>
                  <addressOffset>0x014</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x058</addressOffset>
              <cluster>
                <dim>7</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
