adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
            <cluster>
              <name>MEMCONF200</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_MEMCONF200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x074</addressOffset>
              <cluster>
                <name>BLOCKTYPE</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Trim value for SECURE.MEMCONF200.TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>BOOT</name>
          <description>Unspecified</description>
          <headerStructName>FICR_BOOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5A0</addressOffset>
          <register>
            <name>SIZE</name>
            <description>Size of DATA group</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Number of trim values stored in DATA.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x80</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Compressed address and data pointer.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>REGOFFSET</name>
                <description>Address offset to trim register</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DATAPOINTER</name>
                <description>Pointer to location in TRIM group</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SRAM</name>
          <description>Unspecified</description>
          <headerStructName>FICR_SRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7B0</addressOffset>
          <register>
            <name>REPAIR0</name>
            <description>SRAM repair register 0</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0109</name>
                <description>GD RamController01 Ram 9</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0108</name>
                <description>GD RamController01 Ram 8</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0107</name>
                <description>GD RamController01 Ram 7</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0106</name>
                <description>GD RamController01 Ram 6</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR1</name>
            <description>SRAM repair register 1</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0105</name>
                <description>GD RamController01 Ram 5</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0104</name>
                <description>GD RamController01 Ram 4</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0103</name>
                <description>GD RamController01 Ram 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0102</name>
                <description>GD RamController01 Ram 2</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR2</name>
            <description>SRAM repair register 2</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0101</name>
                <description>GD RamController01 Ram 1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0111</name>
                <description>GD RamController01 Ram 11</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0110</name>
                <description>GD RamController01 Ram 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0100</name>
                <description>GD RamController01 Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR3</name>
            <description>SRAM repair register 3</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0009</name>
                <description>GD RamController00 Ram 9</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0008</name>
                <description>GD RamController00 Ram 8</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0007</name>
                <description>GD RamController00 Ram 7</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0006</name>
                <description>GD RamController00 Ram 6</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR4</name>
            <description>SRAM repair register 4</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0005</name>
                <description>GD RamController00 Ram 5</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0004</name>
                <description>GD RamController00 Ram 4</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0003</name>
                <description>GD RamController00 Ram 3</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0002</name>
                <description>GD RamController00 Ram 2</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR5</name>
            <description>SRAM repair register 5</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0001</name>
                <description>GD RamController00 Ram 1</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0015</name>
                <description>GD RamController00 Ram 15</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0014</name>
                <description>GD RamController00 Ram 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0013</name>
                <description>GD RamController00 Ram 13</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR6</name>
            <description>SRAM repair register 6</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDRAMCTRL0012</name>
                <description>GD RamController00 Ram 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0011</name>
                <description>GD RamController00 Ram 11</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0010</name>
                <description>GD RamController00 Ram 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0000</name>
                <description>GD RamController00 Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR7</name>
            <description>SRAM repair register 7</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDCACHERAM07</name>
                <description>GD Cache Data Ram 7</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDCACHERAM06</name>
                <description>GD Cache Data Ram 6</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDCACHERAM05</name>
                <description>GD Cache Data Ram 5</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDCACHERAM04</name>
                <description>GD Cache Data Ram 4</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR8</name>
            <description>SRAM repair register 8</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>GDCACHERAM03</name>
                <description>GD Cache Data Ram 3</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDCACHERAM02</name>
                <description>GD Cache Data Ram 2</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDCACHERAM01</name>
                <description>GD Cache Data Ram 1</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDCACHERAM00</name>
                <description>GD Cache Data Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CRC32</name>
          <description>CRC32 value for FICR (except this word)</description>
          <addressOffset>0x7FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>CRC32 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
