adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>GRSTCTL</name>
          <description>Reset Register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CSFTRST</name>
              <description>Mode: Host and Device. Core Soft Reset (CSftRst)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIUFSSFTRST</name>
              <description>Mode: Host and Device. PIU FS Dedicated Controller Soft Reset (PIUFSSftRst)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNTRRST</name>
              <description>Mode: Host only. Host Frame Counter Reset (FrmCntrRst)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFFLSH</name>
              <description>Mode: Host and Device. RxFIFO Flush (RxFFlsh)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFFLSH</name>
              <description>Mode: Host and Device. TxFIFO Flush (TxFFlsh)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>Mode: Host and Device. TxFIFO Number (TxFNum)</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXF0</name>
                  <description>Unspecified</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF1</name>
                  <description>Unspecified</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF2</name>
                  <description>Unspecified</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF3</name>
                  <description>Unspecified</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF4</name>
                  <description>Unspecified</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF5</name>
                  <description>Unspecified</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF6</name>
                  <description>Unspecified</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF7</name>
                  <description>Unspecified</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF8</name>
                  <description>Unspecified</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF9</name>
                  <description>Unspecified</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF10</name>
                  <description>Unspecified</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF11</name>
                  <description>Unspecified</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF12</name>
                  <description>Unspecified</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF13</name>
                  <description>Unspecified</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF14</name>
                  <description>Unspecified</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF15</name>
                  <description>Unspecified</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF16</name>
                  <description>Unspecified</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSFTRSTDONE</name>
              <description>Mode: Host and Device</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAREQ</name>
              <description>Mode: Host and Device. DMA Request Signal (DMAReq)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBIDLE</name>
              <description>Mode: Host and Device. AHB Master Idle (AHBIdle)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
