adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>DIEPEMPMSK</name>
          <description>Device IN Endpoint FIFO Empty Interrupt Mask Register</description>
          <addressOffset>0x834</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INEPTXFEMPMSK</name>
              <description>IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EP0_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP1_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP2_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP3_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP4_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP5_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP6_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP7_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP8_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP9_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP10_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP11_MASK</name>
                  <description>Unspecified</description>
                  <value>0x0800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP12_MASK</name>
                  <description>Unspecified</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP13_MASK</name>
                  <description>Unspecified</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP14_MASK</name>
                  <description>Unspecified</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP15_MASK</name>
                  <description>Unspecified</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL0</name>
          <description>Device Control IN Endpoint 0 Control Register</description>
          <addressOffset>0x900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTES64</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES32</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES16</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES8</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE0</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO Number (TxFNum)</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFO0</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO1</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO2</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO3</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO4</name>
                  <description>Unspecified</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO5</name>
                  <description>Unspecified</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO6</name>
                  <description>Unspecified</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO7</name>
                  <description>Unspecified</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO8</name>
                  <description>Unspecified</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO9</name>
                  <description>Unspecified</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO10</name>
                  <description>Unspecified</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO11</name>
                  <description>Unspecified</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO12</name>
                  <description>Unspecified</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO13</name>
                  <description>Unspecified</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO14</name>
                  <description>Unspecified</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO15</name>
                  <description>Unspecified</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLEAR</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSET</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT0</name>
          <description>Device IN Endpoint 0 Interrupt Register</description>
          <addressOffset>0x908</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Condition (TimeOUT)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTKNTXFEMP</name>
              <description>IN Token Received When TxFIFO is Empty (INTknTXFEmp)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTKNEPMIS</name>
              <description>IN Token Received with EP Mismatch (INTknEPMis)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPNAKEFF</name>
              <description>IN Endpoint NAK Effective (INEPNakEff)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFEMP</name>
              <description>Transmit FIFO Empty (TxFEmp)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFIFOUNDRN</name>
              <description>Fifo Underrun (TxfifoUndrn)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet Drop Status (PktDrpSts)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBLEERR</name>
              <description>NAK Interrupt (BbleErr)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKINTRPT</name>
              <description>NAK Interrupt (NAKInterrupt)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NYETINTRPT</name>
              <description>NYET Interrupt (NYETIntrpt)</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
