adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_USBHSCORE0_NS">
      <name>GLOBAL_USBHSCORE0_S</name>
      <description>USBHSCORE 1</description>
      <baseAddress>0x2F700000</baseAddress>
      <alternatePeripheral>GLOBAL_USBHSCORE0_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>OICR_S</name>
      <description>One time programmable Information Configuration Registers</description>
      <baseAddress>0x2F840000</baseAddress>
      <headerStructName>OICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>USER</name>
          <description>Unspecified</description>
          <headerStructName>OICR_USER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x02C</dimIncrement>
            <name>PUBKEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_USER_PUBKEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: First 256 bits of SHA2-512 digest for user public key [n].</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value for word [o] in the key digest [n].</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>REVOKE[%s]</name>
              <description>Description collection: Revocation status of public key [n].</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Revocation status.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRevoked</name>
                      <description>Key not revoked.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x02C</dimIncrement>
            <name>AUTHOPKEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_USER_AUTHOPKEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0B0</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: First 256 bits of SHA2-512 digest for user authentication key [n].</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value for word [o] in the key digest [n].</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>REVOKE[%s]</name>
              <description>Description collection: Revocation status of authentication key [n].</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Revocation status.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRevoked</name>
                      <description>Key not revoked.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Reserved for user data.</description>
            <addressOffset>0x160</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NORDIC</name>
          <description>Unspecified</description>
          <headerStructName>OICR_NORDIC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x02C</dimIncrement>
            <name>PUBKEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_NORDIC_PUBKEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: First 256 bits of SHA2-512 digest for Nordic public key [n].</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value for word [o] in the key digest [n].</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>REVOKE[%s]</name>
              <description>Description collection: Revocation status of public key [n].</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Revocation status.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRevoked</name>
                      <description>Key not revoked.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x02C</dimIncrement>
            <name>AUTHOPKEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_NORDIC_AUTHOPKEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0B0</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DIGEST[%s]</name>
              <description>Description collection: First 256 bits of SHA2-512 digest for Nordic authentication key [n].</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value for word [o] in the key digest [n].</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>REVOKE[%s]</name>
              <description>Description collection: Revocation status of authentication key [n].</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Revocation status.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRevoked</name>
                      <description>Key not revoked.</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>CRACEN</name>
          <description>Unspecified</description>
          <headerStructName>OICR_CRACEN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x360</addressOffset>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>KEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_CRACEN_KEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>VALUE[%s]</name>
              <description>Description collection: Value for the CRACEN KEY[n].</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value for word [o] in the CRACEN.KEY[n].</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>DEVICE</name>
          <description>Unspecified</description>
          <headerStructName>OICR_DEVICE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x3E0</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>UUID[%s]</name>
            <description>Description collection: 128-bit Universally Unique IDentifier (UUID).</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UUID</name>
                <description>Device UUID [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>LCS</name>
          <description>Unspecified</description>
          <headerStructName>OICR_LCS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <dim>0x3</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FFF[%s]</name>
            <description>Description collection: Life cycle state FFF encoding.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
          <register>
            <dim>0x3</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DISCARDED[%s]</name>
            <description>Description collection: Life cycle state DISCARDED encoding.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
          <register>
            <dim>0x3</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ANALYSIS[%s]</name>
            <description>Description collection: Life cycle state ANALYSIS encoding.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
        </cluster>
        <cluster>
          <name>PUF</name>
          <description>Unspecified</description>
          <headerStructName>OICR_PUF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x460</addressOffset>
          <register>
            <name>STATUS</name>
            <description>PUF enrollment status</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>STATUS</name>
                <description>PUF enrollment status.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enrolled</name>
                    <description>PUF enrollment has been completed.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotEnrolled</name>
                    <description>PUF enrollment has not been done.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>INFO</name>
          <description>Unspecified</description>
          <headerStructName>OICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x480</addressOffset>
          <register>
            <name>TYPE</name>
            <description>Device type.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Device type.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is a physical DIE.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is a FPGA.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TESTIMPRINT[%s]</name>
            <description>Description collection: Production test imprint.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>TESTIMPRINT</name>
                <description>Production test imprint.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PRECALIB</name>
          <description>Unspecified</description>
          <headerStructName>OICR_PRECALIB</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>PRECALIBRDY</name>
            <description>PRECALIB information is populated and ready.</description>
            <addressOffset>0x0</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PRECALIBRDY</name>
                <description>PRECALIB information is populated and ready.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Precalibration information is populated and ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotReady</name>
                    <description>Precalibration information is not populated or ready.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <name>INFO</name>
            <description>Unspecified</description>
            <headerStructName>OICR_PRECALIB_INFO</headerStructName>
            <access>read-write</access>
            <addressOffset>0x04</addressOffset>
            <register>
              <dim>0x3B</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>ADDRESS[%s]</name>
              <description>Description collection: Address to trim register</description>
              <addressOffset>0x08</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
            </register>
            <register>
              <dim>0x3B</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DATA[%s]</name>
              <description>Description collection: Data for trim register</description>
              <addressOffset>0x10C</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x04C</dimIncrement>
          <name>MRAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>OICR_MRAM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <cluster>
            <name>LOWAVGCURR</name>
            <description>Unspecified</description>
            <headerStructName>OICR_MRAM_LOWAVGCURR</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>READ</name>
              <description>Description cluster: Timeout value for low average current in case of read.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>WRITE</name>
              <description>Description cluster: Timeout value for low average current in case of write.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ERASE</name>
              <description>Description cluster: Timeout value for low average current in case of erase.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>WAITSTATES</name>
            <description>Description cluster: Default MRAM[n] waitstates.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>READYNEXTTIMEOUT</name>
            <description>Description cluster: Default MRAM[n] READYNEXTTIMEOUT.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
