adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>CLAIMSET</name>
          <description>Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim tag, and determines the number of claim bits implemented.</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIT_0</name>
              <description>Set claim bit 0 and check if bit is implemented or not.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 0 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 0 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_1</name>
              <description>Set claim bit 1 and check if bit is implemented or not.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 1 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 1 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_2</name>
              <description>Set claim bit 2 and check if bit is implemented or not.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 2 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 2 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_3</name>
              <description>Set claim bit 3 and check if bit is implemented or not.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Claim bit 3 is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim bit 3 is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set claim bit 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. 
      The CLAIMCLR register sets the bits in the claim tag to 0 and determines the current value of the claim tag.</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIT_0</name>
              <description>Read or clear claim bit 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 0 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 0 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_1</name>
              <description>Read or clear claim bit 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 1 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 1 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_2</name>
              <description>Read or clear claim bit 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 2 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 2 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_3</name>
              <description>Read or clear claim bit 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Cleared</name>
                  <description>Claim bit 3 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim bit 3 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim bit 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>This is used to enable write access to device registers.</description>
          <addressOffset>0xFB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACCESS</name>
              <description>A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnLock</name>
                  <description>Unlock register interface.</description>
                  <value>0xC5ACCE55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug. 
      Accesses to the extended stimulus port registers are not affected by the lock mechanism. 
      This register must always be present although there might not be any lock access control mechanism. 
      The lock mechanism, where present and locked, must block write accesses to any control register, except the Lock Access Register. 
      For most components this covers all registers except for the Lock Access Register.</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRESENT</name>
              <description>Indicates that a lock control mechanism exists for this device.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>No lock control mechanism exists, writes to the Lock Access Register are ignored.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Lock control mechanism is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKED</name>
              <description>Returns the current status of the Lock.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnLocked</name>
                  <description>Write access is allowed to this device.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Write access to the component is blocked. All writes to control registers are ignored. Reads are permitted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPE</name>
              <description>Indicates if the Lock Access Register is implemented as 8-bit or 32-bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bits32</name>
                  <description>This component implements a 32-bit Lock Access Register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits8</name>
                  <description>This component implements an 8-bit Lock Access Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHSTATUS</name>
          <description>Indicates the current level of tracing permitted by the system</description>
          <addressOffset>0xFB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSID</name>
              <description>Non-secure Invasive Debug</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSNID</name>
              <description>Non-secure Non-Invasive Debug</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SID</name>
              <description>Secure Invasive Debug</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNID</name>
              <description>Secure Non-Invasive Debug</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>Indicates the capabilities of the component.</description>
          <addressOffset>0xFC8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORTNUM</name>
              <description>Indicates the number of master ports implemented.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>The DEVTYPE register provides a debugger with information about the component when the Part Number field is not recognized. The debugger can then report this information.</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>The main type of the component</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InputOutputDevice</name>
                  <description>Indicates that this component has ATB inputs and outputs.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUB</name>
              <description>The sub-type of the component</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Replicator</name>
                  <description>Indicates that this component replicates trace from a single source to multiple targets.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR4</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR_0</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFE0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR_1</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFE4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR_2</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PIDR_3</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>CIDR_0</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>CIDR_1</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>CIDR_2</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>CIDR_3</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
