adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBREPLICATOR210_NS">
      <name>GLOBAL_ATBREPLICATOR211_NS</name>
      <description>ATB Replicator module 1</description>
      <baseAddress>0xBF049000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBREPLICATOR210_NS">
      <name>GLOBAL_ATBREPLICATOR212_NS</name>
      <description>ATB Replicator module 2</description>
      <baseAddress>0xBF04A000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_ATBREPLICATOR210_NS">
      <name>GLOBAL_ATBREPLICATOR213_NS</name>
      <description>ATB Replicator module 3</description>
      <baseAddress>0xBF04B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_ATBFUNNEL210_NS</name>
      <description>ATB funnel module 0</description>
      <baseAddress>0xBF04C000</baseAddress>
      <headerStructName>ATBFUNNEL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ATBFUNNEL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CTRLREG</name>
          <description>The IDFILTER0 register enables the programming of ID filtering for master port 0.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENS_0</name>
              <description>Enable slave port 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_1</name>
              <description>Enable slave port 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_2</name>
              <description>Enable slave port 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_3</name>
              <description>Enable slave port 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_4</name>
              <description>Enable slave port 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_5</name>
              <description>Enable slave port 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_6</name>
              <description>Enable slave port 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENS_7</name>
              <description>Enable slave port 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slave port disabled. This excludes the port from the priority selection scheme.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slave port enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HT</name>
              <description>Hold Time. The formatting scheme can become inefficient when fast switching occurs, and you can use this setting to minimize switching. 
          When a source has nothing to transmit, then another source is selected irrespective of the minimum number of transactions. 
          The ATB funnel holds for the minimum hold time and one additional transaction. The actual hold time is the register value plus 1. 
          The maximum value that can be entered is 0b1110 and this equates to 15 transactions. 0b1111 is reserved.</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIORITYCTRLREG</name>
          <description>The Priority_Ctrl_Reg register defines the order in which inputs are selected. Each 3-bit field is a priority for each particular slave interface.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIPORT0</name>
              <description>Priority value of port number 0.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PRIPORT1</name>
              <description>Priority value of port number 1.</description>
              <lsb>3</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>PRIPORT2</name>
              <description>Priority value of port number 2.</description>
              <lsb>6</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>PRIPORT3</name>
              <description>Priority value of port number 3.</description>
              <lsb>9</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>PRIPORT4</name>
              <description>Priority value of port number 4.</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>PRIPORT5</name>
              <description>Priority value of port number 5.</description>
              <lsb>15</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>PRIPORT6</name>
              <description>Priority value of port number 6.</description>
              <lsb>18</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>PRIPORT7</name>
              <description>Priority value of port number 7.</description>
              <lsb>21</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
