adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_GPIOTE130_NS">
      <name>GLOBAL_GPIOTE130_S</name>
      <description>GPIO Tasks and Events 1</description>
      <baseAddress>0x5F934000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>GPIOTE130_0</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>GPIOTE130_1</name>
        <value>105</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GRTC_NS</name>
      <description>Global Real-time counter 0</description>
      <baseAddress>0x4F99C000</baseAddress>
      <headerStructName>GRTC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GRTC_0</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>GRTC_1</name>
        <value>109</value>
      </interrupt>
      <groupName>GRTC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_CAPTURE[%s]</name>
          <description>Description collection: Capture the counter value to CC[n] register</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASKS_CAPTURE</name>
              <description>Capture the counter value to CC[n] register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_START</name>
          <description>Start the counter</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop the counter</description>
          <addressOffset>0x064</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CLEAR</name>
          <description>Clear the counter</description>
          <addressOffset>0x068</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASKS_CLEAR</name>
              <description>Clear the counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_CAPTURE[%s]</name>
          <description>Description collection: Subscribe configuration for task CAPTURE[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task CAPTURE[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_COMPARE[%s]</name>
          <description>Description collection: Compare event on CC[n] match</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_COMPARE</name>
              <description>Compare event on CC[n] match</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RTCOMPARE</name>
          <description>Compare event on RTCOMPARE register match</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_RTCOMPARE</name>
              <description>Compare event on RTCOMPARE register match</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_RTCOMPARESYNC</name>
          <description>The value written from the register RTCOMPAREL/H or RTCOMPARESYNCL/H is latched to RTCOMPARE</description>
          <addressOffset>0x164</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_RTCOMPARESYNC</name>
              <description>The value written from the register RTCOMPAREL/H or RTCOMPARESYNCL/H is latched to RTCOMPARE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSCOUNTERVALID</name>
          <description>The SYSCOUNTER is in active state and value is valid</description>
          <addressOffset>0x168</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_SYSCOUNTERVALID</name>
              <description>The SYSCOUNTER is in active state and value is valid</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_COMPARE[%s]</name>
          <description>Description collection: Publish configuration for event COMPARE[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event COMPARE[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_RTCOMPARE</name>
          <description>Publish configuration for event RTCOMPARE</description>
          <addressOffset>0x1E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event RTCOMPARE will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTCOMPARE_CLEAR</name>
              <description>Shortcut between event RTCOMPARE and task CLEAR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
