adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>READS</name>
            <description>Number of reads for cache region.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>READS</name>
                <description>Number of reads for cache region.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>WRITES</name>
            <description>Number of writes for cache region.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRITES</name>
                <description>Number of writes for cache region.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DEBUGLOCK</name>
          <description>Lock debug mode.</description>
          <addressOffset>0x430</addressOffset>
          <access>read-writeonce</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEBUGLOCK</name>
              <description>Lock debug mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Debug mode unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Debug mode locked. Ignores any other value written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITELOCK</name>
          <description>Lock cache updates.</description>
          <addressOffset>0x434</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRITELOCK</name>
              <description>Lock cache updates</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Cache updates unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Cache updates locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>VCACHEOWNER[%s]</name>
          <description>Description collection: Cache owners for the virtual cache regions.</description>
          <addressOffset>0x438</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Num</name>
              <description>Owner [n] is mapped to this VCACHE region.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFETCHCONFIG</name>
          <description>Prefetch Policy.</description>
          <addressOffset>0x478</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Prefetch size</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>NEWLINE</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE2</name>
              <description>Prefetch size 2</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>NEWLINE2</name>
              <description>Allow speculative prefetch continue onto a new line.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Speculative prefetch continue onto a new line is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Speculative prefetch continue onto a new line is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RAMC110_S</name>
      <description>RAM Controller 0</description>
      <baseAddress>0x5F083000</baseAddress>
      <headerStructName>RAMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RAMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>WAITSTATES</name>
          <description>Waitstates for read operations.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WAITSTATES</name>
              <description>Number of waitstates for a read from the RAM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
