adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <cluster>
          <name>CONFIG</name>
          <description>MVDMA configuration registers.</description>
          <headerStructName>MVDMA_CONFIG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>MODE</name>
            <description>Mode that defines where the job list pointers are located.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MODE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SingleMode</name>
                    <description>Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start address of a single job list.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MultiMode</name>
                    <description>Registers CONFIG.SOURCELISTPTR and CONFIG.SINKLISTPTR contain start address of a list of job list pointers in memory.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SOURCELISTPTR</name>
            <description>Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Source job descriptor list address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SINKLISTPTR</name>
            <description>Start address of Sink job list or list of job list pointers, depending on value of CONFIG.MODE.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Sink descriptor list address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AXIMODE</name>
            <description>Mode that defines if the AXI bus is AXI or AXI-Lite (one-beat bursts)</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AXIMODE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AXI</name>
                    <description>AXI burst transactions may be longer than one beat.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AXILITE</name>
                    <description>All AXI transactions are one-beat accesses.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>PPIB110_S</name>
      <description>PPIB APB registers 0</description>
      <baseAddress>0x5F098000</baseAddress>
      <headerStructName>PPIB</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PPIB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_SEND[%s]</name>
          <description>Description collection: This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TASKS_SEND</name>
              <description>This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SUBSCRIBE_SEND[%s]</name>
          <description>Description collection: Subscribe configuration for task SEND[n]</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SEND[n] will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_RECEIVE[%s]</name>
          <description>Description collection: This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event.</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_RECEIVE</name>
              <description>This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PUBLISH_RECEIVE[%s]</name>
          <description>Description collection: Publish configuration for event RECEIVE[n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event RECEIVE[n] will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
