adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM120_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x5F8E6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM120</name>
        <value>230</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x4F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM121_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x5F8E7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SPIM121</name>
        <value>231</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS120_S</name>
      <description>PCGCSlave 1</description>
      <baseAddress>0x5F8EA000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS121_S</name>
      <description>PCGCSlave 2</description>
      <baseAddress>0x5F8EB000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS122_S</name>
      <description>PCGCSlave 3</description>
      <baseAddress>0x5F8EC000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM110_S">
      <name>PCGCM121_S</name>
      <description>PCGC Master 2</description>
      <baseAddress>0x5F8ED000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PPIB110_S">
      <name>PPIB120_S</name>
      <description>PPIB APB registers 1</description>
      <baseAddress>0x5F8EE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PPIB110_S">
      <name>PPIB121_S</name>
      <description>PPIB APB registers 2</description>
      <baseAddress>0x5F8EF000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="RAMC110_S">
      <name>RAMC130_S</name>
      <description>RAM Controller 4</description>
      <baseAddress>0x5F903000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="RAMC110_S">
      <name>RAMC131_S</name>
      <description>RAM Controller 5</description>
      <baseAddress>0x5F904000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="MEMCONF120_S">
      <name>MEMCONF130_S</name>
      <description>Memory configuration 1</description>
      <baseAddress>0x5F905000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR120_NS">
      <name>GLOBAL_VPR130_NS</name>
      <description>VPR peripheral registers 4</description>
      <baseAddress>0x4F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_VPR120_NS">
      <name>GLOBAL_VPR130_S</name>
      <description>VPR peripheral registers 5</description>
      <baseAddress>0x5F908000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>VPR130</name>
        <value>264</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS130_S</name>
      <description>PCGCSlave 4</description>
      <baseAddress>0x5F90E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_NS</name>
      <description>IPCT APB registers 2</description>
      <baseAddress>0x4F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT130_S</name>
      <description>IPCT APB registers 3</description>
      <baseAddress>0x5F921000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT130_0</name>
        <value>289</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC130_NS</name>
      <description>Distributed programmable peripheral interconnect controller 2</description>
      <baseAddress>0x4F922000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC130_S</name>
      <description>Distributed programmable peripheral interconnect controller 3</description>
      <baseAddress>0x5F922000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="PPIB110_S">
      <name>PPIB130_S</name>
      <description>PPIB APB registers 3</description>
      <baseAddress>0x5F925000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
