adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN_CNF[%s]</name>
          <description>Description collection: Pin n configuration of GPIO pin</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>DIR</name>
              <description>Pin direction. Same physical register as DIR register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Configure pin as an input pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Configure pin as an output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>Connect or disconnect input buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Connect</name>
                  <description>Connect input buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disconnect</name>
                  <description>Disconnect input buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL</name>
              <description>Pull configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No pull</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulldown</name>
                  <description>Pull down on pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pullup</name>
                  <description>Pull up on pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE0</name>
              <description>Drive configuration for '0'</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>Standard '0'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0</name>
                  <description>High drive '0'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <description>Disconnect '0'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0</name>
                  <description>Extra high drive '0'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE1</name>
              <description>Drive configuration for '1'</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1</name>
                  <description>Standard '1'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H1</name>
                  <description>High drive '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <description>Disconnect '1'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E1</name>
                  <description>Extra high drive '1'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE</name>
              <description>Pin sensing mechanism</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Sense for high level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Sense for low level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_0</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_1</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_2</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_3</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_4</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_5</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_6</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAEN_7</name>
              <description>Control of analog slices for pads with ATB functionality. LSB in ANAEN control slice 0, and so on.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Slice disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Slice enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRLSEL</name>
              <description>Select which MCU/Subsystem controls this pin</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO peripheral</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPR</name>
                  <description>VPR processor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRC</name>
                  <description>GRC system</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SecureDomain</name>
                  <description>Secure Domain</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM</name>
                  <description>PWM peripheral</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C</name>
                  <description>I3C peripheral</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Serial</name>
                  <description>SPIM/SPIS/TWIM/TWIS/UARTE peripheral</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSSPI</name>
                  <description>High-speed SPI peripheral</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RadioCore</name>
                  <description>Radio Core</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXMIF</name>
                  <description>EXMIF peripheral</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CELL</name>
                  <description>Cellular specific (Halti-only)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTB</name>
                  <description>Digital Test Bus</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TND</name>
                  <description>Trace and Debug Subsystem</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKPIN</name>
              <description>Enable clock on the pin.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
