adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_P0_NS">
      <name>GLOBAL_P9_S</name>
      <description>GPIO Port 11</description>
      <baseAddress>0x5F939200</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_GPIOINTERNAL_NS">
      <name>GLOBAL_GPIOINTERNAL_S</name>
      <description>GPIO Internal 1</description>
      <baseAddress>0x5F939E00</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS131_S</name>
      <description>PCGCSlave 5</description>
      <baseAddress>0x5F93C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM110_S">
      <name>PCGCM130_S</name>
      <description>PCGC Master 3</description>
      <baseAddress>0x5F93D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="LRCCONF200_S">
      <name>LRCCONF130_S</name>
      <description>LRCCONF 2</description>
      <baseAddress>0x5F93E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM110_S">
      <name>PCGCM131_S</name>
      <description>PCGC Master 4</description>
      <baseAddress>0x5F93F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral>
      <name>GRCCONF_S</name>
      <description>GRCCONF</description>
      <baseAddress>0x5F940000</baseAddress>
      <headerStructName>GRCCONF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GRCCONF_0</name>
        <value>320</value>
      </interrupt>
      <interrupt>
        <name>GRCCONF_1</name>
        <value>321</value>
      </interrupt>
      <interrupt>
        <name>GRCCONF_2</name>
        <value>322</value>
      </interrupt>
      <groupName>GRCCONF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_GRCPERIPH0[%s]</name>
          <description>Description collection: Event indicating that interrupt triggered for GRC peripheral identifier [n]</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_GRCPERIPH0</name>
              <description>Event indicating that interrupt triggered for GRC peripheral identifier [n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_GRCPERIPH1[%s]</name>
          <description>Description collection: Event indicating that interrupt triggered for GRC peripheral identifier [32 + n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_GRCPERIPH1</name>
              <description>Event indicating that interrupt triggered for GRC peripheral identifier [32 + n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSTEMOFFREADY</name>
          <description>Event indicating that the device is ready to go to System OFF</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_SYSTEMOFFREADY</name>
              <description>Event indicating that the device is ready to go to System OFF</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSTEMOFFNOTREADY</name>
          <description>Event indicating that the device is not ready to go to System OFF</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVENTS_SYSTEMOFFNOTREADY</name>
              <description>Event indicating that the device is not ready to go to System OFF</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
