adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>SLEEP</name>
            <description>Sleep configuration</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MODE</name>
                <description>FLL16M sleep mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal mode operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Sleep</name>
                    <description>Power down the FLL16M core</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RETDCO16M</name>
                <description>Retain DCO16M.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>No retention while powered down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Retain all inputs while powered down</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RETCKSW16M</name>
                <description>Retain CKSW16M.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>No retention while powered down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Retain all inputs while powered down</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RETAINFINETRIM</name>
            <description>Fine trim retain control</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RETAIN</name>
                <description>Retain control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoRetain</name>
                    <description>No retain.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Retain</name>
                    <description>Retain control when FLL16M goes to open-loop mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OVERRIDELOCKED</name>
            <description>Override the LOCKED signal</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>OVERRIDE</name>
                <description>Override</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No Operation.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Override</name>
                    <description>Override</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>REFCLOCK</name>
            <description>Reference clock configuration</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELREF</name>
                <description>Selection for the reference clock signal in software controlled mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clock32Ki</name>
                    <description>The 32Ki clock selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock16M</name>
                    <description>The 16MHz clock selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLE32KI</name>
                <description>Disable the 32Ki reference clock</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>The 32Ki reference clock is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>The 32Ki reference clock is disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEFAULTSLOPE</name>
            <description>Default slope value for FLL16M</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Slope value</description>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FREQMEASLIMIT</name>
            <description>Frequency measurement limit</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000002</resetValue>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <name>DCO16M</name>
            <description>Unspecified</description>
            <headerStructName>FLL16M_OVERRIDE_DCO16M</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>PWRUP</name>
              <description>Override the PWRUP signal to the DCO16M analog module</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RETAIN</name>
              <description>Override the RETAIN signal to the analog module</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SLEEP</name>
              <description>Override the SLEEP signal to the DCO16M analog module</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>READY</name>
              <description>Override the DCO16M READY signal from the analog module</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SETTLED</name>
              <description>Override the DCO16M SETTLED signal from the analog module</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CKSW16M</name>
            <description>Unspecified</description>
            <headerStructName>FLL16M_OVERRIDE_CKSW16M</headerStructName>
            <access>read-write</access>
            <addressOffset>0x014</addressOffset>
            <register>
              <name>PWRUP</name>
              <description>Override the PWRUP signal to the CKSW16M analog module</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RETAIN</name>
              <description>Override the RETAIN signal to the analog module</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CKSEL</name>
              <description>Override the CKSEL signal to the analog module</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Override value for the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>READY</name>
              <description>Override the CKSW16M READY signal from the analog module</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SETTLED</name>
              <description>Override the CKSW16M SETTLED signal from the analog module</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CKSELOUT</name>
              <description>Override the CKSW16M CKSEL signal from the analog module</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
