adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>DTB2CONFIG</name>
            <description>Digital Test Bus 2 (DTB2) configuration</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB2</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PWRUPPWM</name>
                    <description>PWRUP_PWM selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWRUPCH2</name>
                    <description>PWRUPCH2 selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VOUTCMP3</name>
                    <description>VOUTCMP3 selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMCMP2</name>
                    <description>PWMCMP2 selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DRVSEC2</name>
                    <description>DRVSEC2 selected</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HSLIM</name>
                    <description>HSLIM selected</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DRVLS</name>
                    <description>DRVLS selected</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODEHP</name>
                    <description>MODE_HP selected</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HVBUCKSETTLED</name>
                    <description>HVBUCK_SETTLED selected</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SETTLEDCH1</name>
                    <description>SETTLED_CH1 selected</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMLIM11V8</name>
                    <description>PWM_LIM1_1V8 selected</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMOC2</name>
                    <description>PWM_OC2 selected</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMSKIP2</name>
                    <description>PWM_SKIP2 selected</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMFAULT2</name>
                    <description>PWM_FAULT2 selected</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHRG2</name>
                    <description>CHRG2 selected</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTB3CONFIG</name>
            <description>Digital Test Bus 3 (DTB3) configuration</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB3</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PWRUPHYST</name>
                    <description>PWRUP_HYST selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWRUPCH3</name>
                    <description>PWRUPCH3 selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VOUTCMP2</name>
                    <description>VOUTCMP2 selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMCMP3</name>
                    <description>PWMCMP3 selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DRVSEC3</name>
                    <description>DRVSEC3 selected</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECREADY</name>
                    <description>SECREADY selected</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODEPWM</name>
                    <description>MODE_PWM selected</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SETTLEDCH2</name>
                    <description>SETTLED_CH2 selected</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMILIM31V8</name>
                    <description>PWM_ILIM3_1V8 selected</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMOC3</name>
                    <description>PWM_OC3 selected</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMSKIP3</name>
                    <description>PWM_SKIP3 selected</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMFAULT2</name>
                    <description>PWM_FAULT2 selected</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CHRG3</name>
                    <description>CHRG3 selected</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRUPDELTEST</name>
                <description>Enable the PWRUP delay test circuit</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP delay test circuit is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP delay test circuit is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCFG</name>
            <description>Test mode configuration</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PWRUPIBPSR</name>
                <description>Enable PWRUP_IBPSR</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP_IBPSR disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP_IBPSR enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRUPIBPP</name>
                <description>Enable PWRUP_IBPP</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP_IBPP disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP_IBPP enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRUPWM</name>
                <description>Enable PWRUP_PWM</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP_PWM disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP_PWM enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRUPHYST</name>
                <description>Enable PWRUP_HYST</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP_HYST disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP_HYST enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MINIDRV</name>
                <description>Enable MINIDRV</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>MINIDRV disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>MINIDRV enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAMPLEPDCCH</name>
                <description>Sample P_DCCH by ready</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Sample P_DCCH disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Sample P_DCCH enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRUPPDCCHV</name>
                <description>Enable mux PWRUP_P_DCCHV</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUPPDCCHV disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUPPDCCHV enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRVSEC</name>
                <description>Select DRVSEC</description>
                <lsb>7</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal mode, DRVSEC2 in reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DRVSEC1</name>
                    <description>DRVSEC1 selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DRVSEC2</name>
                    <description>DRVSEC2 selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>OFF</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HSFORCEON</name>
                <description>Enable HS force on</description>
                <lsb>9</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HSILIM</name>
                    <description>HS force on HSILIM gating</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPI</name>
                    <description>GPI</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HSforceon</name>
                    <description>HS force on</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LSFORCEON</name>
                <description>Enable LS force on</description>
                <lsb>11</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Normal</name>
                    <description>Normal mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LSforceoff</name>
                    <description>LS force off-zx gating</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPI</name>
                    <description>GPI</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LSforceon</name>
                    <description>LS force on</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIGOFF</name>
                <description>Enable DIGOFF</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>DIGOFF disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>DIGOFF enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIGDIG</name>
                <description>Enable SIGDIG</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>SIGDIG disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>SIGDIG enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GPI</name>
                <description>Enable GPI (PSEUDO PWM)</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>GPI disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>GPI enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALEN</name>
            <description>Calibration enable</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALEN</name>
                <description>Calibration enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATCMPOff</name>
                    <description>ATCMP Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATCMPOn</name>
                    <description>ATCMP On</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALCMP</name>
            <description>Calibration compare</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALCMP</name>
                <description>Calibration compare</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
