adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>DTB2CONFIG</name>
            <description>Digital Test Bus 2 (DTB2) configuration</description>
            <addressOffset>0x18</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB2</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VrefTimerReq</name>
                    <description>Vref timer request</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RefreshTimerReq</name>
                    <description>ULPR refresh timer request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PwrupIBPSR</name>
                    <description>IBPSR power up signal</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PwrupHP</name>
                    <description>High power core power up signal</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PwrupLP</name>
                    <description>Low power core power up signal</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CancelLP</name>
                    <description>Low power core cancel signal</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PwrupIBPP5n</name>
                    <description>BIAS_IBPP_5N power up signal</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>None</name>
                    <description>None selected, logic 0</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTB3CONFIG</name>
            <description>Digital Test Bus 3 (DTB3) configuration</description>
            <addressOffset>0x1C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PWRUPDELTEST</name>
                <description>Enable the PWRUP delay test circuit</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PWRUP delay test circuit is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PWRUP delay test circuit is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TCFG</name>
            <description>Test mode configuration</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VREFTIMERREQ</name>
                <description>Controls VREF_TIMER_REQ_SW_1V8</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RFRENDCRITERIA</name>
                <description>Controls RFR_END_CRITERIA_REQ_SW_1V8</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LPCANCELREQ</name>
                <description>Controls LDP_LP_CANCEL_REQ_AO_1V8</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MODELPREQ</name>
                <description>Controls MODE_LP_REQ_SW_1V8</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MODEULPRREQ</name>
                <description>Controls MODE_ULPR_REQ_SW_1V8</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PWRUPIBPP</name>
                <description>Controls PWRUP_IBPP_BIAS_SW_1V8</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PWRUPLP</name>
                <description>Controls PWRUP_LDO_LP_AO_1V8</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>PWRUPHP</name>
                <description>Controls PWRUP_LDO_HP_AO_1V8</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PWRUPIBPSR</name>
                <description>Controls PWRUP_IBPSR_BIAS_SW_1V8</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TCFGENABLE</name>
                <description>Enable TCFG control</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>REFRESHCMPCLK</name>
                <description>Controls clock input of refresh comparator</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CALEN</name>
            <description>Calibration enable</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALEN</name>
                <description>Calibration enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATCMPOff</name>
                    <description>ATCMP Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATCMPOn</name>
                    <description>ATCMP ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALCMP</name>
            <description>Calibration compare</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALCMP</name>
                <description>Calibration compare</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
