adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>ULTRALOWPOWER</name>
            <description>Ultra low power mode ripple trimming</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Ripple trimming value.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>5mV</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>15mV</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>25mV</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>35mV</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BPDET</name>
            <description>BP detector offset trimming</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Voltage offset trimming value.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIRROR</name>
          <description>Enable LOCK for mirrored registers</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock for mirrored registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOUT</name>
          <description>Output voltage programming</description>
          <addressOffset>0x484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>Output voltage value</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Voltage regulator mode</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>Automatically handled by the peripheral</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HighPower</name>
                  <description>High power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Low power refresh mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UltraLowPowerRefresh</name>
                  <description>Ultra-low power refresh mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass forced mode</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITHRESHOLD</name>
          <description>Current threshold for mode transistion</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>Current consumption</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>VREGAO0V8_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>PWRUP</name>
            <description>Override the PWRUP signal to the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RETAIN</name>
            <description>Override the RETAIN signal to the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MODELP</name>
            <description>Override the MODE LP signal to the analog module</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MODEULPR</name>
            <description>Override the MODE ULPR signal to the analog module</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>REQBYPASS</name>
            <description>Override the REQ BYPASS signal to the analog module</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>READY</name>
            <description>Override the READY signal from the analog module</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SETTLED</name>
            <description>Override the SETTLED signal from the analog module</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BPREADY</name>
            <description>Override the BP READY signal from the analog module</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IOUTCMPHP</name>
            <description>Override the IOUTCMP_HP signal from the analog module</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IOUTCMPLP</name>
            <description>Override the IOUTCMP_LP signal from the analog module</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>Current value of the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>VREGAO0V8_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>ATB0CONFIG</name>
            <description>Analog Test Bus 0 (ATB0) configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB0</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ExtVref</name>
                    <description>External Vref</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VddSw1v8</name>
                    <description>VDD_SW_1V8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ibpp50n</name>
                    <description>IBPP_50N</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VSS</name>
                    <description>VSS</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ATB1CONFIG</name>
            <description>Analog Test Bus 1 (ATB1) configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB1</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VrefHP</name>
                    <description>HP vref</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vref0V9Dvt</name>
                    <description>VREF_0V9_DVT</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VrefLp</name>
                    <description>Buffered VREF_LP</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vfb</name>
                    <description>VFB</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
