adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
          <register>
            <name>TCFG</name>
            <description>Test mode configuration</description>
            <addressOffset>0x30</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VREFTIMERREQ</name>
                <description>Controls VREF_TIMER_REQ_SW_1V8</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RFRENDCRITERIA</name>
                <description>Controls RFR_END_CRITERIA_REQ_SW_1V8</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LPCANCELREQ</name>
                <description>Controls LDP_LP_CANCEL_REQ_AO_1V8</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MODELPREQ</name>
                <description>Controls MODE_LP_REQ_SW_1V8</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>MODEULPRREQ</name>
                <description>Controls MODE_ULPR_REQ_SW_1V8</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PWRUPIBPP</name>
                <description>Controls PWRUP_IBPP_BIAS_SW_1V8</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>PWRUPLP</name>
                <description>Controls PWRUP_LDO_LP_AO_1V8</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>PWRUPHP</name>
                <description>Controls PWRUP_LDO_HP_AO_1V8</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PWRUPIBPSR</name>
                <description>Controls PWRUP_IBPSR_BIAS_SW_1V8</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TCFGENABLE</name>
                <description>Enable TCFG control</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>REFRESHCMPCLK</name>
                <description>Controls clock input of refresh comparator</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CALEN</name>
            <description>Calibration enable</description>
            <addressOffset>0x34</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALEN</name>
                <description>Calibration enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ATCMPOff</name>
                    <description>ATCMP Off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATCMPOn</name>
                    <description>ATCMP ON</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CALCMP</name>
            <description>Calibration compare</description>
            <addressOffset>0x38</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALCMP</name>
                <description>Calibration compare</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>VREGSU_S</name>
      <description>VREGSU peripheral</description>
      <baseAddress>0x5F966000</baseAddress>
      <headerStructName>VREGSU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VREGSU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>PWRUPCTRL</name>
          <description>Power up control</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTRL</name>
              <description>Power up control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PowerDown</name>
                  <description>Power down</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PowerUp</name>
                  <description>Power up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>VREGSU_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>ATB1CONFIG</name>
            <description>Analog Test Bus 1 (ATB1) configuration</description>
            <addressOffset>0x04</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for ATB1</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Spare0</name>
                    <description>HiZ. For future use</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VFB1V2</name>
                    <description>VDD_AO_1V8 scaled by 2/3</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the analog test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Analog test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Analog test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
