adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VDETIO_S</name>
      <description>VDETIO peripheral</description>
      <baseAddress>0x5F974000</baseAddress>
      <headerStructName>VDETIO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VDETIO</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Voltage detector status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRGOOD_0</name>
              <description>Power good detector status for port [0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_1</name>
              <description>Power good detector status for port [1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_2</name>
              <description>Power good detector status for port [2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_3</name>
              <description>Power good detector status for port [3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_4</name>
              <description>Power good detector status for port [4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_5</name>
              <description>Power good detector status for port [5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_6</name>
              <description>Power good detector status for port [6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_7</name>
              <description>Power good detector status for port [7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_8</name>
              <description>Power good detector status for port [8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_9</name>
              <description>Power good detector status for port [9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_10</name>
              <description>Power good detector status for port [10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_11</name>
              <description>Power good detector status for port [11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_12</name>
              <description>Power good detector status for port [12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_13</name>
              <description>Power good detector status for port [13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_14</name>
              <description>Power good detector status for port [14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRGOOD_15</name>
              <description>Power good detector status for port [15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AboveThr</name>
                  <description>Power good detector detected voltage above threshold level</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThr</name>
                  <description>Power good detector detected voltage below threshold level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
