adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>ADC is ready. No on-going conversion.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>ADC is busy. Single conversion in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCRMSTATUS</name>
          <description>PCRM Status</description>
          <addressOffset>0x404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>PCRM Ack Status for the PCRM clean power request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoAck</name>
                  <description>Ack not received.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ack</name>
                  <description>Ack received.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SAADC_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <dim>0x6</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>LINCALCOEFF[%s]</name>
            <description>Description collection: Linearity calibration coefficient</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>VAL</name>
                <description>value</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>ENABLE</name>
          <description>Enable or disable ADC</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable ADC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ADC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ADC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>CH[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_SAADC_CH</headerStructName>
          <access>read-write</access>
          <addressOffset>0x510</addressOffset>
          <register>
            <name>PSELP</name>
            <description>Description cluster: Input positive pin selection for CH[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PSELP</name>
                <description>Analog positive input channel</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput0</name>
                    <description>AIN0</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput1</name>
                    <description>AIN1</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput2</name>
                    <description>AIN2</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput3</name>
                    <description>AIN3</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput4</name>
                    <description>AIN4</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput5</name>
                    <description>AIN5</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput6</name>
                    <description>AIN6</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput7</name>
                    <description>AIN7</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB2</name>
                    <description>ATB2</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest0</name>
                    <description>Connected to VDD_AO_1V8</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest1</name>
                    <description>Connected to VDD_AO_0V8</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest2</name>
                    <description>Connected to VDD_IO_1V2</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>Reserved for future use</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVSS</name>
                    <description>AVSS</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference, voltage determined by PADC_REFSEL</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput8</name>
                    <description>AIN8</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput9</name>
                    <description>AIN9</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput10</name>
                    <description>AIN10</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput11</name>
                    <description>AIN11</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput12</name>
                    <description>AIN12</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput13</name>
                    <description>AIN13</description>
                    <value>0x16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PSELN</name>
            <description>Description cluster: Input negative pin selection for CH[n]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PSELN</name>
                <description>Analog negative input, enables differential channel</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NC</name>
                    <description>Not connected</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput0</name>
                    <description>AIN0</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput1</name>
                    <description>AIN1</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput2</name>
                    <description>AIN2</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput3</name>
                    <description>AIN3</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput4</name>
                    <description>AIN4</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput5</name>
                    <description>AIN5</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput6</name>
                    <description>AIN6</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput7</name>
                    <description>AIN7</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB0</name>
                    <description>ATB0</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ATB1</name>
                    <description>ATB1</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest3</name>
                    <description>Connected to VDD_1V0</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest4</name>
                    <description>Reserved for VDD_PPA_1V6 (Halti only)</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDTest5</name>
                    <description>Reserved for VDD_AO_5V0</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>Reserved for future use</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AVSS</name>
                    <description>AVSS</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SELREF</name>
                    <description>Selected reference, voltage determined by PADC_REFSEL</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput8</name>
                    <description>AIN8</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput9</name>
                    <description>AIN9</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput10</name>
                    <description>AIN10</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput11</name>
                    <description>AIN11</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput12</name>
                    <description>AIN12</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AnalogInput13</name>
                    <description>AIN13</description>
                    <value>0x16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Input configuration for CH[n]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <fields>
              <field>
                <name>RESP</name>
                <description>Positive channel resistor control</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass resistor ladder</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pulldown</name>
                    <description>Pull-down to GND</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pullup</name>
                    <description>Pull-up to VDD_AO_1V8</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDAO1V8div2</name>
                    <description>Set input at VDD_AO_1V8/2</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESN</name>
                <description>Negative channel resistor control</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass resistor ladder</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pulldown</name>
                    <description>Pull-down to GND</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Pullup</name>
                    <description>Pull-up to VDD_AO_1V8</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VDDAO1V8div2</name>
                    <description>Set input at VDD_AO_1V8/2</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GAIN</name>
                <description>Gain control</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Gain2_3</name>
                    <description>2/3</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain1</name>
                    <description>1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain2</name>
                    <description>2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Gain4</name>
                    <description>4</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BURST</name>
                <description>Enable burst mode</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Burst mode is disabled (normal operation)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as fast as it can, and sends the average to Data RAM.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REFSEL</name>
                <description>Reference control</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Internal reference (1.024 V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>External reference given at PADC_EXT_REF_1V2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IBPSR4UPADC</name>
                    <description>Reference generated by IBPSR_4U_PADC</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Enable differential mode</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SE</name>
                    <description>Single ended, PSELN will be ignored, negative input to ADC shorted to GND</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Diff</name>
                    <description>Differential</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TACQ</name>
                <description>Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is ((TACQ+1) x 125 ns)</description>
                <lsb>16</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>TCONV</name>
                <description>Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns)</description>
                <lsb>28</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIMIT</name>
            <description>Description cluster: High/low limits for event monitoring a channel</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF8000</resetValue>
            <fields>
              <field>
                <name>LOW</name>
                <description>Low level limit</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>High level limit</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>REGRESULT</name>
          <description>Last conversion result</description>
          <addressOffset>0x5EC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGRESULT</name>
              <description>Result of the previous ADC conversion</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
