adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>A4</name>
          <description>Slope of 5th piece wise linear function</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000044E</resetValue>
          <fields>
            <field>
              <name>A4</name>
              <description>Slope of 5th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A5</name>
          <description>Slope of 6th piece wise linear function</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x000004B7</resetValue>
          <fields>
            <field>
              <name>A5</name>
              <description>Slope of 6th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>A6</name>
          <description>Slope of 7th piece wise linear function</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x000004B7</resetValue>
          <fields>
            <field>
              <name>A6</name>
              <description>Slope of 7th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B0</name>
          <description>y-intercept of 1st piece wise linear function</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FC7</resetValue>
          <fields>
            <field>
              <name>B0</name>
              <description>y-intercept of 1st piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B1</name>
          <description>y-intercept of 2nd piece wise linear function</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F71</resetValue>
          <fields>
            <field>
              <name>B1</name>
              <description>y-intercept of 2nd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B2</name>
          <description>y-intercept of 3rd piece wise linear function</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000F6C</resetValue>
          <fields>
            <field>
              <name>B2</name>
              <description>y-intercept of 3rd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B3</name>
          <description>y-intercept of 4th piece wise linear function</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000FCB</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>y-intercept of 4th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B4</name>
          <description>y-intercept of 5th piece wise linear function</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004B</resetValue>
          <fields>
            <field>
              <name>B4</name>
              <description>y-intercept of 5th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B5</name>
          <description>y-intercept of 6th piece wise linear function</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F6</resetValue>
          <fields>
            <field>
              <name>B5</name>
              <description>y-intercept of 6th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>B6</name>
          <description>y-intercept of 7th piece wise linear function</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F6</resetValue>
          <fields>
            <field>
              <name>B6</name>
              <description>y-intercept of 7th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T0</name>
          <description>End point of 1st piece wise linear function</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000E1</resetValue>
          <fields>
            <field>
              <name>T0</name>
              <description>End point of 1st piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T1</name>
          <description>End point of 2nd piece wise linear function</description>
          <addressOffset>0x564</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000F9</resetValue>
          <fields>
            <field>
              <name>T1</name>
              <description>End point of 2nd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T2</name>
          <description>End point of 3rd piece wise linear function</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>T2</name>
              <description>End point of 3rd piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T3</name>
          <description>End point of 4th piece wise linear function</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000026</resetValue>
          <fields>
            <field>
              <name>T3</name>
              <description>End point of 4th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T4</name>
          <description>End point of 5th piece wise linear function</description>
          <addressOffset>0x570</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>T4</name>
              <description>End point of 5th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T5</name>
          <description>End point of 6th piece wise linear function</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000078</resetValue>
          <fields>
            <field>
              <name>T5</name>
              <description>End point of 6th piece wise linear function</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
