adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>SHUNTALGCONFIG</name>
          <description>Configuration settings for Shunt regulator algorithm</description>
          <addressOffset>0x6AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00004482</resetValue>
          <fields>
            <field>
              <name>RSTPULSEWIDTH</name>
              <description>Pulse width of peak reset signal</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RSTPPEAKPERIOD</name>
              <description>Period of peak reset signal</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>MULTTRIMSTARTVALUE</name>
              <description>Start value for MULT_TRIM</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>MULTTRIMLOVWERBOUND</name>
              <description>Lower bound on MULT_TRIM</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DISABLESHUNT</name>
              <description>Control shunt regulation during load modulation</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shunt regulation is disabled during load modulation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shunt regulation is enabled during load modulation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTB0CFGNFCTRET</name>
          <description>Digital test signal switch control</description>
          <addressOffset>0x6B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTB0CFGNFCTRET</name>
              <description>Selection of digital test bus output</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPWRUPNFCTFIELDDET</name>
          <description>Power up field detect part of circuit and 5 nA IBPP current reference</description>
          <addressOffset>0x6B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALPWRUPNFCTFIELDDET</name>
              <description>Power up field detect part of circuit and 5 nA IBPP current reference</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTRSTEDCLK</name>
          <description>Resets edge detect signal in NFCT_CLOCKREC_GF22N</description>
          <addressOffset>0x6BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALNFCTRSTEDCLK</name>
              <description>Resets edge detect signal in NFCT_CLOCKREC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTRSTPEAKLEV</name>
          <description>Resets peak detectors in NFCT_SHUNTREG_GF22N</description>
          <addressOffset>0x6C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALNFCTRSTPEAKLEV</name>
              <description>Resets peak detectors in NFCT_SHUNTREG_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALNFCTCALEN</name>
          <description>Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N</description>
          <addressOffset>0x6C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALNFCTCALEN</name>
              <description>Enable calibration of ring oscillator in NFCT_CLOCKREC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALTCFGNFCT</name>
          <description>Digital test signal switch control</description>
          <addressOffset>0x6C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TESTBIT1</name>
              <description>Tuning voltage of PLL oscillator set to constant Hi-Z voltage so it can be overridden by ATB</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>TESTBIT2</name>
              <description>Sets the oscillator input of the phase detector to 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>TESTBIT3</name>
              <description>Overrides the output of the XOR phase detector to 1</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>TESTBIT4</name>
              <description>Spare (Clock recovery)</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>TESTBIT5</name>
              <description>Spare (Clock recovery)</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TESTBIT6</name>
              <description>Spare</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>TESTBIT7</name>
              <description>Spare (Local bias)</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>TESTBIT8</name>
              <description>Bypass LDO</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TESTBIT9</name>
              <description>Spare (LDO)</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TESTBIT10</name>
              <description>Spare</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTFIELDDETCFG</name>
          <description>NFCT_FIELDDET_GF22N configuration bits</description>
          <addressOffset>0x6CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>THRESHOLDVOLTAGE</name>
              <description>Trimming of field detector threshold voltage</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>HYSTERESISLEVEL</name>
              <description>Change hysteresis level of internal comparator</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TRIMIBPP</name>
              <description>Trim 5 nA IBPP current (from NFCT_BIAS_GF22N)</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTCTRL</name>
          <description>Spare digital control signals</description>
          <addressOffset>0x6D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIGITALCONTROL</name>
              <description>Spare digital control signals</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUPNFCTLDO</name>
          <description>Power-up for LDO</description>
          <addressOffset>0x6D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POWERBLEEDCURRENT</name>
              <description>Power-up with bleed current</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>POWERNOBLEEDCURRENT</name>
              <description>Power-up without bleed current</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCONFIG</name>
          <description>NFC pad configuration</description>
          <addressOffset>0x6D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable NFC pads</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFC pads are used as GPIO pins</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The NFC pads are configured as NFC antenna pins</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCTCALCMP</name>
          <description>Output from the calibration comparator</description>
          <addressOffset>0x6E0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NFCTCALCMP</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCCaLCmpLow</name>
                  <description>Trim code low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCCaLCmpHigh</name>
                  <description>Trim code high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BIASCFG</name>
          <description>Configuration of NFCT_BIAS_GF22N</description>
          <addressOffset>0x6E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007000</resetValue>
          <fields>
            <field>
              <name>TRIMIBPSR</name>
              <description>Fine trim IBPSR 4 uA bias current This will also trim VREF_SWAT_0V8 in steps of 10 mV</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>COARSEIBPSR</name>
              <description>Coarse IBPSR 4 uA. Might be needed to cover trimming range if modelling is an issue</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>REFERENCEVOLTAGE</name>
              <description>Reference voltage level</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RINGOSCCONFIG</name>
          <description>Configuration settings for ring oscillator algorithm</description>
          <addressOffset>0x6E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALIBRATIONSOURCE</name>
              <description>Calibration source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFC carrier signal used as calibration source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>16 MHz crystal oscillator used as calibration source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALRETAIN</name>
          <description>Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N</description>
          <addressOffset>0x6EC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRVALRETAIN</name>
              <description>Retain - Latch and isolate all RET_0V8 inputs to NFCT_ANA_GF22N and P_NFC_GF22N</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ATB0CFGNFCTRET</name>
          <description>Analog test signal switch control</description>
          <addressOffset>0x6F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATB0CFGNFCTRET</name>
              <description>Selection of analog test bus output</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ATB1CFGNFCTRET</name>
          <description>Analog test signal switch control</description>
          <addressOffset>0x6F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANALOGTESTBUS</name>
              <description>Selection of analog test bus output</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SPARE</name>
              <description>Spare</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CMFBENABLE</name>
          <description>Enable calibration of cmfbPdRef</description>
          <addressOffset>0x6F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMFBENABLE</name>
              <description>Enable calibration of cmfbPdRef</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVRVALPADNFCCFG</name>
          <description>Override of P_NFCCFG_RET_0V8 to P_NFC_GF22N</description>
          <addressOffset>0x6FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMMONREGEN</name>
              <description>Enable/disable common-regulation at pad</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>COMMONMODEVOLT</name>
              <description>Set common-mode voltage level at pad</description>
              <lsb>1</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>SHUNTREGSHUNT</name>
              <description>Multiplier of shunt transistor between NFC1 and NFC2 during shunt regulation</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>SHUNTTRANSISTORS</name>
              <description>Gate voltage of shunt transistors</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>SHUNTREGLOAD</name>
              <description>Multiplier of shunt transistor between NFC1 and NFC2 during load modulation</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>BULKBIAS</name>
              <description>Enable/disable bulk bias of shunt transistors (flipped-well devices) during load modulation</description>
              <lsb>23</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>GATEVOLTAGECLAMP</name>
              <description>Back gate voltage of clamp during 2.6 V clamping mode</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETPTR</name>
          <description>Packet pointer for TXD and RXD data storage in Data RAM</description>
          <addressOffset>0xA60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTR</name>
              <description>Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte-aligned RAM address.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXLEN</name>
          <description>Size of the RAM buffer allocated to TXD and RXD data storage each</description>
          <addressOffset>0xA64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Size of the RAM buffer allocated to TXD and RXD data storage each</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
