adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
        <register>
          <name>SW1SW2</name>
          <description>Sw1 and Sw2 bytes received from Sim card in T=1 mode</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW1</name>
              <description>Sw1 data byte received</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>SW2</name>
              <description>Sw2 data byte received</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONVENTION</name>
          <description>Data convention used in traffic between controller and SIM card</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATACONVENTION</name>
              <description>Data convention between controller and SIM card</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Direct</name>
                  <description>Direct convention: 1 = High, LSB first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inverse</name>
                  <description>Inverse convention: 1 = Low, MSB first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LRCOUT</name>
          <description>Latest generated LRC value</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LRCOUT</name>
              <description>Latest generated LRC value</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATA</name>
          <description>NonDMA received data</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>NonDMA received data or Rx data of T=1 S block if RxBufferLength = 3</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>T0SWXCOUNT</name>
          <description>Number of SWx bytes received after T=0 Rx DMA finished</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T0SWXCOUNT</name>
              <description>Number of SWx bytes received after T=0 Rx DMA finished</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKRATE</name>
          <description>Divider value for setting the clock rate to the SIM card.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>CLOCKRATE</name>
              <description>Divider for setting the clock frequency to the SIM card clock (clock  = input clock / ClockRate</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUDRATE</name>
          <description>Divider value for setting the baud rate to the SIM card.</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000174</resetValue>
          <fields>
            <field>
              <name>BAUDRATE</name>
              <description>Divider for setting the baud rate to the SIM card.(Baud rate  = Sim card clock/BaudRate).</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHARACTERGUARDTIME</name>
          <description>Character Guard time</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000C</resetValue>
          <fields>
            <field>
              <name>CHARACTERGUARDTIME</name>
              <description>Guard time from leading edge of the character to the leading edge of the next character in ETU</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHARACTERWAITTIME</name>
          <description>Character Wait time</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>CHARACTERWAITTIME</name>
              <description>T=1 character Rx wait time in ETU</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCKWAITTIME</name>
          <description>Block Wait time</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002580</resetValue>
          <fields>
            <field>
              <name>BLOCKWAITTIME</name>
              <description>Block wait time in ETU, default 9600</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PROTOCOL</name>
          <description>Protocol selection</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol selection 0: T=0, 1: T=1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>T0</name>
                  <description>T=0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>T1</name>
                  <description>T=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWIMPEDANCE</name>
          <description>Low impedance driver use</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOWIMPEDANCE</name>
              <description>Low impedance driver use</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OpenDrain</name>
                  <description>open drain</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowImpedance</name>
                  <description>use 		low impedance drivers</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T1PCBCONTROL</name>
          <description>T=1 Tx PCB bits 5:6</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOREDATABIT</name>
              <description>More data (chaining) bit, PCB[5]</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>SENDSEQUENCENUMBER</name>
              <description>Send Sequence number, PCB[6]</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>RECEIVEDSEQUENCENUMBER</name>
              <description>Rx Send Sequence number in T1 I Block</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKCONTROL</name>
          <description>Clock Control</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable clock</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ClockOff</name>
                  <description>Clock is off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockOn</name>
                  <description>Clock is on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKSTOP</name>
              <description>Clock stop state</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Illegal</name>
                  <description>Not allowed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Clock stops low</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Clock stops high</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLTAGE</name>
          <description>Sim card operating voltage</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VOLTAGE</name>
              <description>Sim card operating voltage</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0V</name>
                  <description>Card voltage off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1800mV</name>
                  <description>Card operating voltage 1.8V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3000mV</name>
                  <description>Card operating voltage 3V</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LRCENABLE</name>
          <description>LRC Calculation enable</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LRCENABLE</name>
              <description>LRC Calculation enable for T=1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>LRC calculation disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>LRC 			calculation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA</name>
          <description>NonDMA data to be sent to the SIM card</description>
          <addressOffset>0x52C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>NonDMA data to be sent to the SIM card</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCONFIG</name>
          <description>Uart configuration</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UARTCONFIG</name>
              <description>Uart configuration, for details see Uart spec</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITEMAXATT</name>
          <description>Number of write attempts before error interrupt</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>WRITEMAXATT</name>
              <description>Number of write attempts before error interrupt</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>READMAXATT</name>
          <description>Number of read attempts before error interrupt</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>READMAXATT</name>
              <description>Number of read attempts before error interrupt</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBTESTWRITE</name>
          <description>Test data to write through AHB RX bus</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRITETESTDATA</name>
              <description>Test data for Ahb write access for Ahb Rx bus</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AHBTESTENABLE</name>
              <description>Enable bit for Ahb testing, both read and write</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBTESTREAD</name>
          <description>Test data to read through AHB TX bus</description>
          <addressOffset>0x540</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READTESTDATA</name>
              <description>Test data read through Ahb Tx bus</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPROLOGUEDATA</name>
          <description>Four first Rx data bytes from card</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXBYTE0</name>
              <description>First Rx byte from card</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RXBYTE1</name>
              <description>Second Rx byte from card</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>RXBYTE2</name>
              <description>Third Rx byte from card</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>RXBYTE3</name>
              <description>Fourth Rx byte from card</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTENABLE</name>
          <description>UART Enable</description>
          <addressOffset>0x574</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>UART master enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTRXENABLE</name>
          <description>UART Rx Enable</description>
          <addressOffset>0x578</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>UART Rx enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTTXENABLE</name>
          <description>UART Tx Enable</description>
          <addressOffset>0x57C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>UART Tx enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXADDR</name>
          <description>DMA access  buffer RAM start address</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXSTARTADDRESS</name>
              <description>DMA access  buffer RAM start address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBUFFERSIZE</name>
          <description>Byte count to receive in Dma Rx operation</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXBUFFERSIZE</name>
              <description>Byte count to receive in Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXBYTECOUNT</name>
          <description>Byte count received in latest Dma Rx operation</description>
          <addressOffset>0x608</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXBYTECOUNT</name>
              <description>Byte count received in latest Dma Rx operation</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x60C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARXSELECTLIST</name>
          <description>Rx select address from list</description>
          <addressOffset>0x610</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMARXSELECTLIST</name>
              <description>Select address from list</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXADDR</name>
          <description>Start address for DMA access in buffer RAM</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXSTARTADDRESS</name>
              <description>Start address for DMA access in buffer RAM</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBUFFERSIZE</name>
          <description>Byte count to transmit in Dma Rx operation</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXBUFFERSIZE</name>
              <description>Byte count to transmit in Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXBYTECOUNT</name>
          <description>Byte count transmitted in latest Dma Tx operation</description>
          <addressOffset>0x708</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXBYTECOUNT</name>
              <description>Byte count transmitted in latest Dma Tx operation</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATXENABLE</name>
          <description>Enable for rx dma</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMATXENABLE</name>
              <description>Enable for rx dma</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
