adamkondraciuk/nrfx/mdk/nrf54h20_enga_sysctrl.svd
    <peripheral derivedFrom="PPIB110_S">
      <name>PPIB136_S</name>
      <description>PPIB APB registers 9</description>
      <baseAddress>0x5F9CD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS137_S</name>
      <description>PCGCSlave 11</description>
      <baseAddress>0x5F9CE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM110_S">
      <name>PCGCM137_S</name>
      <description>PCGC Master 10</description>
      <baseAddress>0x5F9CF000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC136_NS</name>
      <description>Distributed programmable peripheral interconnect controller 14</description>
      <baseAddress>0x4F9D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120_NS">
      <name>GLOBAL_DPPIC136_S</name>
      <description>Distributed programmable peripheral interconnect controller 15</description>
      <baseAddress>0x5F9D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER136_NS</name>
      <description>Timer/Counter 16</description>
      <baseAddress>0x4F9D2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER136</name>
        <value>466</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER136_S</name>
      <description>Timer/Counter 17</description>
      <baseAddress>0x5F9D2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER136</name>
        <value>466</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER137_NS</name>
      <description>Timer/Counter 18</description>
      <baseAddress>0x4F9D3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER137</name>
        <value>467</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120_NS">
      <name>GLOBAL_TIMER137_S</name>
      <description>Timer/Counter 19</description>
      <baseAddress>0x5F9D3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER137</name>
        <value>467</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM133_NS</name>
      <description>Pulse width modulation unit 8</description>
      <baseAddress>0x4F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM133_S</name>
      <description>Pulse width modulation unit 9</description>
      <baseAddress>0x5F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM136_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 16</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS136_NS</name>
      <description>SPI Slave 14</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM136_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 12</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS136_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 12</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE136_NS</name>
      <description>UART with EasyDMA 14</description>
      <baseAddress>0x4F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM136_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 17</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS136_S</name>
      <description>SPI Slave 15</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM136_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 13</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS136_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 13</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE136_S</name>
      <description>UART with EasyDMA 15</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM137_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 18</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS137_NS</name>
      <description>SPI Slave 16</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM137_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 14</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS137_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 14</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE137_NS</name>
      <description>UART with EasyDMA 16</description>
      <baseAddress>0x4F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM137_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 19</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS137_S</name>
      <description>SPI Slave 17</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM137_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 15</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS137_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 15</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE137_S</name>
      <description>UART with EasyDMA 17</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PPIB110_S">
      <name>PPIB137_S</name>
      <description>PPIB APB registers 10</description>
      <baseAddress>0x5F9DD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCS110_S">
      <name>PCGCS138_S</name>
      <description>PCGCSlave 12</description>
      <baseAddress>0x5F9DE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM110_S">
      <name>PCGCM138_S</name>
      <description>PCGC Master 11</description>
      <baseAddress>0x5F9DF000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
  </peripherals>
</device>